
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/railgun-0402/aws-ecs-terraform/actions/runs/9939965344)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01b4181d47b75a48a]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0f20c51a85fe8855e]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0976e976e55165e74]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0605d5b5292d129a2]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-095aa2eb3ad7a1a86]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06321e43e8fc70f2e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0e121dc93b6238a2e]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-00b603f53cdd89bc8]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0df3711fc20783636]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0e334d45359b4e750]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-098e87735554434dd]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f5b5cb453fe9e076]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-00c51391578727e12]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09e77d5073d2cd0d0]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-058e7196cd55256ae]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ea05b1221237569e]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-034e9f6746244244a]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-015fdd72014e47093]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f5b5cb453fe9e0761080289494]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-07ef48a8535c03f6f]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0cdcef87f3a9725f2]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-00b603f53cdd89bc81080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0df3711fc207836361080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-01b4181d47b75a48a"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-01b4181d47b75a48a"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 5s [id=sg-0266ad44b28d18856]
aws_security_group.alb: Creation complete after 5s [id=sg-0a34280c839615c8e]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-4093621102]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"e8a9fae8aa028a51df6343213a0155c2a77c295c","Vars":{},"WorkflowName":"Terraform"} -->